api_denuncias/app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token_access" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token_access", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjo1LCJleHAiOjE1ODQ4MTc2Mzl9.AM6Wx5H8xedmDMQGchkBviGISaOwt6QNpyiiu1KS_P0"], ["updated_at", "2020-03-20 19:07:19.583557"], ["id", 5]]
---
  def login
    @user = User.find_by_email(params[:email])
    if @user&.authenticate(params[:password])
      token = JsonWebToken.encode(user_id: @user.id)
      time = Time.now + 24.hours.to_i

      # Insere o token na tabela usuário, atualizando o registro do usuário (individualizando o token)
      @user.token_access = token
      @user.save()