api_denuncias/app/controllers/denunciations_controller.rb

def index
  @denuncia = Denunciation.all
---
SELECT "denunciations".* FROM "denunciations"

def create
  @user = User.where("token_access=?",params[:token_access_user])

  if @user.present?
    # @denuncia = Denunciation.new(denunciation_params)
    @denuncia = Denunciation.new
    @denuncia[:descricao] = params[:descricao]
    @denuncia[:status] = params[:status]
    @denuncia[:latitude] = params[:latitude]
    @denuncia[:longitude] = params[:longitude]
    @denuncia[:medida_adotada] = params[:medida_adotada]
    @denuncia[:user_id] = @user[0]["id"]

    if @denuncia.save
---
SELECT "users".* FROM "users" WHERE (token_access='eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjo1LCJleHAiOjE1ODQ4MTc2Mzl9.AM6Wx5H8xedmDMQGchkBviGISaOwt6QNpyiiu1KS_P2')
SELECT "users".* FROM "users" WHERE (token_access='eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjo1LCJleHAiOjE1ODQ4MTc2Mzl9.AM6Wx5H8xedmDMQGchkBviGISaOwt6QNpyiiu1KS_P0')
INSERT INTO "denunciations" ("descricao", "status", "latitude", "longitude", "user_id", "medida_adotada", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

def update
  @denuncia = Denunciation.find_by_id(params[:id])
---
SELECT "denunciations".* FROM "denunciations" WHERE "denunciations"."id" IS NULL LIMIT $1  [["LIMIT", 1]]