api_denuncias/app/controllers/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "user@gmail.com"], ["id", 1], ["LIMIT", 1]]
---
  def forgot
    if params[:email].blank? # verifica se o email foi informado
      return render json: {error: 'Email não informado'}
    end

    @user = User.find_by_email(params[:email]) # busca o usuário a quem o email pertence

    if @user.present?

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "97ad43cfb005cef15e15"], ["LIMIT", 1]]
---
  def reset
    token = params[:token].to_s

    if params[:email].blank?
      return render json: {error: 'Não há token...'}
    end

    @user = User.find_by_reset_password_token(params[:token])