api_denuncias/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE (token_access='eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjo1LCJleHAiOjE1ODQ4MTc2Mzl9.AM6Wx5H8xedmDMQGchkBviGISaOwt6QNpyiiu1KS_P0')
UPDATE "users" SET "username" = $1, "token_access" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "aris2020"], ["token_access", "qweewq123"], ["updated_at", "2020-03-20 20:03:08.581910"], ["id", 2]]
---
  def update

    user = User.where("token_access=?",params[:token_access])
    if user
      if user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aris"], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by_username!(params[:_username])